import React from 'react';
import CoursePageWrapper from '../../../../components/coursePageElements/coursePageWrapper';
import ChapterTitle from '../../../../components/coursePageElements/courseText/chapterTitle';
import ChapterParagraph from '../../../../components/coursePageElements/courseText/chapterParagraph';
const ChapterOne = () => {
  return (
    <CoursePageWrapper>
      <ChapterTitle>
        Поняття САУ. Графічне представлення САУ. Типи САУ. Принципи регулювання САУ.
      </ChapterTitle>
      <ChapterParagraph>
        Широке впровадження систем автоматичного управління (САУ) у різні галузі техніки, у тому числі ядерну енергетику, підвищення вимог до якості їхньої роботи викликають нагальну потребу у вивченні інженерно-технічної фундаментальної дисципліни, змістом якої є теорія автоматичного управління (ТАУ).
      </ChapterParagraph>
      <ChapterParagraph>
        Існує надзвичайно велике розмаїття автоматичних систем, що виконують ті або інші функції з управління різними фізичними процесами в усіх галузях техніки. У цих системах сполучаються досить різноманітні за конструкцією механічні, електричні та інші пристрої, що становлять загалом, складний комплекс взаємодіючих один з одним елементів.
      </ChapterParagraph>
      <ChapterParagraph>
        У великих технічних задачах однією з найважливіших проблем є структурування системи. Складну систему необхідно розглядати як із загальних позицій, так і з позицій усіх її компонентів, тим більше, що при проектуванні сучасних систем управління серед багатьох інших задач вирішуються й такі, як удосконалювання виробничих процесів, підвищення ефективності використання енергії. І рішення приймаються спираючись на знання фахівців не однієї галузі, а на компетенцію інженерів-електронників, програмістів, прикладних фахівців і безперечно, на науково-технічних працівників, що займаються розробкою та експлуатацією систем автоматичного управління.
      </ChapterParagraph>
      <ChapterParagraph>
        Початок формування техніки і теорії автоматичного управління багато авторів відносять до епохи промислової революції в Європі, а саме до розробки І.І. Ползуновим регулятора рівня води в  паровому котлі (1765) і розробці  Дж. Уаттом регулятора швидкості обертання валу парової машини (1769).
      </ChapterParagraph>
    </CoursePageWrapper>
  );
};

export default ChapterOne;
