import React from 'react';
import CoursePageWrapper from '../../../../../components/coursePageElements/coursePageWrapper';
import ChapterTitle from '../../../../../components/coursePageElements/courseText/chapterTitle';
import ChapterParagraph from '../../../../../components/coursePageElements/courseText/chapterParagraph';
import TaskImage from '../../../../../components/taskPageElements/taskImage';
import img1 from '../../../../../../../assets/images/1.png';
import img2 from '../../../../../../../assets/images/2.png';
import img3 from '../../../../../../../assets/images/3.png';
import img4 from '../../../../../../../assets/images/4.png';
import img5 from '../../../../../../../assets/images/5.png';

function Chapter1_2() {
  return (
    <CoursePageWrapper>
      <ChapterTitle>
        Основні терміни та позначення. Класифікація САУ
      </ChapterTitle>
      <ChapterParagraph>
        Управління – процес, що забезпечує необхідне за цільовим призначенням
        протікання процесів перетворення енергії, речовини та інформації,
        підтримування працездатності та безаварійного функціонування об'єкта
        шляхом збору та обробки інформації про його стан та стан зовнішнього
        середовища, вироблення рішень про вплив на об'єкт та їхнє виконання.
      </ChapterParagraph>
      <ChapterParagraph>
        Регулювання – окремий випадок управління, ціль якого полягає в
        забезпеченні близькості поточних значень однієї або декількох координат
        об'єкта управління до їхніх заданих значень.
      </ChapterParagraph>
      <ChapterParagraph>
        Об'єкт управління (регулювання) – певний технічний пристрій (літак,
        верстат, парова турбіна і т.п.), для досягнення результатів
        функціонування якого необхідні і припустимі спеціально організовані
        впливи. Об'єкт управління, на який подаються управляючі впливи, можна
        назвати керованим об'єктом.
      </ChapterParagraph>
      <ChapterParagraph>
        Об'єктами управління (ОУ) можуть бути як окремі об'єкти, виділені за
        певними ознаками (наприклад, конструктивними, функціональними), так і
        сукупності об'єктів - комплекси. Залежно від властивостей або
        призначення об'єктів можуть бути виділені технічні, технологічні,
        організаційні, соціальні та інші об'єкти управління і комплекси.
      </ChapterParagraph>
      <ChapterParagraph>
        Будь-яку систему автоматичного управління (САУ) можна представити у
        вигляді:
      </ChapterParagraph>
      <TaskImage width="600px" src={img1} />
      <ChapterParagraph>
        Де <br />
        <ol>
          <li>ПУ – пристрій управління; </li>
          <li>Р – регулятор;</li>
          <li>ОУ – об'єкт управління;</li>
          <li>ОР – об'єкт регулювання;</li>
          <li>x(t) – задавальний вплив;</li>
          <li>u(t) – управляючий вплив;</li>
          <li>y(t) – регульована величина;</li>
          <li>f(t) – збурювальний вплив.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Ціль управління в технічних системах – певні значення або співвідношення
        значень координат процесів в об'єкті управління або їхня зміна в часі,
        при яких забезпечується досягнення бажаних результатів функціонування
        об'єкта.
      </ChapterParagraph>
      <ChapterParagraph>
        Система автоматичного управління – система, що складається з об'єкта
        управління та пристрою управління, у якій автоматично виконується
        заданий процес.
      </ChapterParagraph>
      <ChapterParagraph>
        Пристрій управління або регулятор – сукупність пристроїв, за допомогою
        яких здійснюється управління головним технологічним параметром (фізичною
        величиною).
      </ChapterParagraph>
      <ChapterParagraph>
        Регулятор виробляє управляючі (регулюючі) впливи, які, впливаючи на ОУ,
        підтримують або змінюють за певним законом регульовану величину.
      </ChapterParagraph>
      <ChapterParagraph>
        Зовнішні впливи –задавальні впливи , що визначають необхідний закон
        (алгоритм) регулювання вихідної величини ОУ, і збурювальні впливи, що
        порушують необхідний функціональний зв'язок між вихідною величиною ОУ і
        задавальним впливом.
      </ChapterParagraph>
      <ChapterParagraph>
        Вихідною величиною (координатою) ОУ або регульованою (керованою)
        величиною, є зазвичай головний технологічний параметр (швидкість,
        потужність, напруга, температура, тиск, положення та ін.)
      </ChapterParagraph>
      <ChapterParagraph>
        Завади - збурення, що викликають викривлення сигналів в САУ, що зазвичай
        незначно впливають на регульовану величину і важкодоступні для виміру.
      </ChapterParagraph>
      <ChapterParagraph>
        Головним завданням САУ є «чітке» відпрацювання задавального впливу, і
        компенсація діючих в системі збурень.
      </ChapterParagraph>
      <ChapterParagraph>Класифікація САУ</ChapterParagraph>
      <ChapterParagraph>
        Класифікація систем автоматичного управління може здійснюватися за
        наступними ознаками:
      </ChapterParagraph>
      <ChapterParagraph>
        За алгоритмом функціонування розрізняють:
        <ol>
          <li>системи стабілізації;</li>
          <li>слідкуючі системи;</li>
          <li>системи програмного управління.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Системи стабілізації – САУ, у яких регульована величина підтримується
        постійною в ході всього циклу управління.
        <ol>
          <li>x(t)=const</li>
          <li>y(t)=const</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Прикладом таких систем може слугувати система стабілізації обертання
        диска (рис. 1.2) [4].
      </ChapterParagraph>
      <ChapterParagraph>
        У багатьох сучасних приладах використовується диск, що повинен
        обертатися з постійною швидкістю. Це, наприклад, програвач
        компакт-дисків або грамплатівок, дисковод комп'ютера, які вимагають
        обертання з постійною швидкістю.
      </ChapterParagraph>
      <ChapterParagraph>
        Щоб забезпечити обертання диска, ми повинні в якості виконавчого
        пристрою обрати електродвигун постійного струму, швидкість обертання
        якого пропорційна прикладеній напрузі. А тому що вхідний сигнал двигуна
        повинен мати достатню потужність, нам також буде потрібно вибрати
        підсилювач. Для реалізації системи із принципом управління за
        відхиленням необхідно вимірювати вихідну величину; для цього вибираємо
        датчик зворотного зв'язку - тахогенератор, вихідна напруга якого
        пропорційна швидкості обертання його валу.
      </ChapterParagraph>
      <ChapterParagraph>
        Замкнута система буде мати вигляд, представлений на рис. 1.2. Сигнал
        похибки утворюється як різниця між вхідною напругою і напругою
        тахогенератора.
      </ChapterParagraph>
      <TaskImage width="700px" src={img2} />
      <ChapterParagraph>
        Слідкуючі САУ – САУ в яких регульована величина змінюється за
        заздалегідь невідомим законом.
        <ol>
          <li>x(t)=var</li>
          <li>y(t)=var</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Прикладами таких систем можуть бути різні системи наведення з
        радіолокаційною станцією (РЛС), системи телеуправління і самонаведення,
        автопілоти, цілеспрямовувачі курсу літальних апаратів.
      </ChapterParagraph>
      <ChapterParagraph>
        Системи програмного управління – САУ, у яких регульована величина
        змінюється за заздалегідь відомим законом (програмою), що задається
        функцією .
      </ChapterParagraph>
      <ChapterParagraph>
        Наприклад, програма завдання кута нахилу осі ракети при запуску з
        переходом від перпендикулярного до горизонтального руху ракети, верстати
        із числовим програмним управлінням.
      </ChapterParagraph>
      <ChapterParagraph>
        За характером ланок, що включаються до складу САУ, системи поділяються
        на:
        <ol>
          <li>лінійні;</li>
          <li>нелінійні;</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        В усталених режимах САУ описуються алгебраїчними, а в перехідних
        процесах - диференціальними або різницевими рівняннями. Якщо ці рівняння
        лінійні, то система називається лінійною. У протилежному випадку система
        називається нелінійною. Система нелінійна, якщо в її складі є хоча б
        один нелінійний елемент.
      </ChapterParagraph>
      <ChapterParagraph>
        Всі реальні САУ звичайно є нелінійними, але САУ з несуттєвою
        нелінійністю характеристики - лінеаризують, використовуючи різні методи
        лінеаризації. Основні типи нелінійності:
        <ol>
          <li>релейні;</li>
          <li>
            ланки, які містять добутки змінних, або їхніх похідних, корінь,
            квадрат;
          </li>
          <li>ланки зі змінною структурою.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Залежно від характеру зміни в часі впливів між елементами, розрізняють
        системи:
        <ol>
          <li>безперервні;</li>
          <li>дискретні.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        У безперервних системах всі впливи є безперервними функціями часу. У
        дискретних системах є елемент, що перетворює безперервний сигнал у
        дискретний. Залежно від характеру цього перетворення (квантування
        сигналів) дискретні системи розбиваються на:
        <ol>
          <li>імпульсні - квантування за часом;</li>
          <li>релейні - квантування за рівнем;</li>
          <li>цифрові - комбіноване квантування.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Якщо до складу САУ включений цифровий пристрій або комп'ютер у цілому,
        то такі САУ називаються цифровими. Будь-яку цифрову систему можна звести
        до структурної схеми, представленої на рис. 1.4:
      </ChapterParagraph>
      <TaskImage width="700px" src={img3} />
      <ChapterParagraph>
        Комп'ютер або цифровий обчислювальний пристрій у цій системі за певною
        програмою обробляє представлену в цифровій формі похибку і видає на
        виході сигнал також у цифровій формі. Перетворення безперервного сигналу
        в цифрову форму здійснюється аналого-цифровим перетворювачем (АЦП), як
        показано на рис. 1.4, а вихідний сигнал перетворюється в безперервну
        форму за допомогою цифро-аналогового перетворювача (ЦАП).
      </ChapterParagraph>
      <ChapterParagraph>
        За ступенем самонастроювання, адаптації, оптимізації системи
        автоматичного управління поділяються на:
        <ol>
          <li>адаптивні;</li>
          <li>оптимальні.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Система управління в процесі функціонування повинна реагувати на зміну
        властивостей об'єкта управління і зовнішніх впливів і на основі
        результатів обробки відповідної інформації пристосовуватися до нових
        умов шляхом зміни структури і (або) параметрів управляючого пристрою
        так, щоб показник якості досягав екстремального значення або перебував у
        заданому діапазоні. Такі системи називають адаптивними.
      </ChapterParagraph>
      <ChapterParagraph>
        При оптимальному управлінні об'єкт переводиться з будь-якого початкового
        стану в заданий кінцевий стан, при цьому обраний критерій оптимальності
        повинен досягати екстремального значення (тут мінімуму). Наведена задача
        зветься задача на максимальну швидкодію.
      </ChapterParagraph>
      <ChapterParagraph>
        Стаціонарні і нестаціонарні САУ. Якщо в процесі функціонування системи
        змінюються параметри із часом, то такі системи називаються
        нестаціонарними.
      </ChapterParagraph>
      <ChapterParagraph>
        САУ із зосередженими і розподіленими параметрами. Системи із
        зосередженими параметрами описуються звичайними диференціальними
        рівняннями, а з розподіленими - у часткових похідних.
      </ChapterParagraph>
      <ChapterParagraph>
        Залежно від величини статичного відхилення (похибки) системи
        поділяються:
        <ol>
          <li>статичні;</li>
          <li>астатичні.</li>
        </ol>
      </ChapterParagraph>
      <ChapterParagraph>
        Якщо статичне відхилення не дорівнює нулю, то така система стосовно
        розглянутого зовнішнього впливу називається статичною.
      </ChapterParagraph>
      <ChapterParagraph>
        Якщо статичне відхилення дорівнює нулю, систему автоматичного
        управління, стосовно розглянутого зовнішньому впливу, називають
        астатичною.
      </ChapterParagraph>
      <ChapterParagraph>
        Приблизний вигляд перехідних процесів у статичній (а) і астатичній (б)
        САУ (генератор постійного струму) при стрибкоподібному збільшенні струму
        навантаження на величину в момент часу показаний на рис. 1.8.
      </ChapterParagraph>
      <TaskImage width="600px" src={img4} />
      <ChapterParagraph>
        Відмінною рисою астатичної системи є наявність інтегруючого елемента.
        Якщо в якості такого елемента використовується двигун, то кут повороту
        буде пов'язаний з напругою залежністю:
      </ChapterParagraph>
      <TaskImage width="300px" src={img5} />
      <ChapterParagraph>
        де Kдв – коефіцієнт передачі двигуна за струмом.
      </ChapterParagraph>
    </CoursePageWrapper>
  );
}

export default Chapter1_2;
