import React from 'react';
import CoursePageWrapper from '../../../../../components/coursePageElements/coursePageWrapper';
import ChapterTitle from '../../../../../components/coursePageElements/courseText/chapterTitle';
import ChapterParagraph from '../../../../../components/coursePageElements/courseText/chapterParagraph';

function Chapter1_1() {
  return (
    <CoursePageWrapper>
      <ChapterTitle>История САУ</ChapterTitle>
      <ChapterParagraph>
        Широке впровадження систем автоматичного управління (САУ) у різні галузі
        техніки, у тому числі ядерну енергетику, підвищення вимог до якості
        їхньої роботи викликають нагальну потребу у вивченні інженерно-технічної
        фундаментальної дисципліни, змістом якої є теорія автоматичного
        управління (ТАУ).
      </ChapterParagraph>
      <ChapterParagraph>
        Існує надзвичайно велике розмаїття автоматичних систем, що виконують ті
        або інші функції з управління різними фізичними процесами в усіх галузях
        техніки. У цих системах сполучаються досить різноманітні за конструкцією
        механічні, електричні та інші пристрої, що становлять загалом, складний
        комплекс взаємодіючих один з одним елементів.
      </ChapterParagraph>
      <ChapterParagraph>
        У великих технічних задачах однією з найважливіших проблем є
        структурування системи. Складну систему необхідно розглядати як із
        загальних позицій, так і з позицій усіх її компонентів, тим більше, що
        при проектуванні сучасних систем управління серед багатьох інших задач
        вирішуються й такі, як удосконалювання виробничих процесів, підвищення
        ефективності використання енергії. І рішення приймаються спираючись на
        знання фахівців не однієї галузі, а на компетенцію
        інженерів-електронників, програмістів, прикладних фахівців і безперечно,
        на науково-технічних працівників, що займаються розробкою та
        експлуатацією систем автоматичного управління.
      </ChapterParagraph>
      <ChapterParagraph>
        Початок формування техніки і теорії автоматичного управління багато
        авторів відносять до епохи промислової революції в Європі, а саме до
        розробки І.І. Ползуновим регулятора рівня води в паровому котлі (1765) і
        розробці Дж. Уаттом регулятора швидкості обертання валу парової машини
        (1769).
      </ChapterParagraph>
      <ChapterParagraph>
        В 1866 році Дж. Максвелл, використовуючи диференціальне рівняння як
        модель регулятора, заклав математичні основи теорії управління, а в 1877
        І.О. Вишнеградський сформував математичну теорію регуляторів, тим самим
        поклав початок системному підходу по дослідженню автоматичних систем. У
        теорії автоматичного управління особливу роль грає аналіз стійкості,
        засновником строгої теорії стійкості є О.М. Ляпунов (1892).
      </ChapterParagraph>
      <ChapterParagraph>
        Особливо інтенсивно теорія автоматичного управління почала розвиватися з
        кінця 30-тих років, коли були розроблені частотні методи аналізу
        лінійних систем ( Г. Боде, Г.Найквист, В.В. Солодовников - 1932),
        поставлена проблема якості та розроблені методи аналізу нелінійних
        систем (Л.С. Гольдфарб, Е.П.Попов - з 1940).
      </ChapterParagraph>
      <ChapterParagraph>
        Великий поштовх розвитку теорії та практики автоматичного управління
        викликала Друга світова війна, коли виникла потреба в створенні
        автопілотів, систем гарматного наведення, станцій радарного
        спостереження, що працюють на основі принципу зворотного зв'язку.
        Наприклад, метод кореневого годографу, що є сполучним початком між
        методами аналізу та синтезу в часовій і частотній областях і являє собою
        досить потужний аналітичний інструмент дослідження, запропонований в
        1948 році У. Евансом.
      </ChapterParagraph>
      <ChapterParagraph>
        Запуск першого штучного супутника Землі та початок космічної ери дали
        новий поштовх розвитку теорії управління, виникла необхідність розробки
        теоретичних основ теорії оптимального управління. Проблема оптимального
        за часом управління інтенсивно вивчалася математиками СРСР і США. В
        1953-1957 рр. Р.Беллман, Р.В. Гамкрелідзе, М.М. Красовський розвинули
        основи теорії задачі оптимального за швидкодією управління, потім в 1958
        році на міжнародному конгресі математиків в Единбурзі Л.С. Понтрягін
        проголосив свій знаменитий принцип максимуму.
      </ChapterParagraph>
      <ChapterParagraph>
        У 1970 році запропоновані моделі систем у змінних стану, що послужило
        основою формування другого методу аналізу та синтезу систем - методу
        простору станів, який багато авторів ототожнюють із сучасною теорією
        управління, оскільки переважна більшість сучасних методів проектування
        систем управління заснована на описі та моделюванні систем у просторі
        станів.
      </ChapterParagraph>
      <ChapterParagraph>
        З 1980-х докладно досліджуються робастні та адаптивні системи
        управління, розробляються теоретичні основи аналізу та синтезу систем з
        різного роду невизначеностями.
      </ChapterParagraph>
    </CoursePageWrapper>
  );
}

export default Chapter1_1;
