import React from 'react';
import CoursePageWrapper from '../../../../../components/coursePageElements/coursePageWrapper';
import ChapterTitle from '../../../../../components/coursePageElements/courseText/chapterTitle';
import ChapterParagraph from '../../../../../components/coursePageElements/courseText/chapterParagraph';
import TaskImage from '../../../../../components/taskPageElements/taskImage';

import img9 from '../../../../../../assets/images/9.png'
import img10 from '../../../../../../assets/images/10.png'

const Chapter2_1 = () => {
  return (
    <CoursePageWrapper>
      <ChapterTitle>Представлення САУ динамічними ланцюжками.</ChapterTitle>
      <ChapterParagraph>
        Функціональна схема САУ являє собою сукупність з'єднаних певним чином
        елементів (ланок, блоків) за виконуваними ними функціями, незалежно від їхньої фізичної природи.
      </ChapterParagraph>
      <ChapterParagraph>
        Типова функціональна схема САУ представлена  на рис. 1.9, де прийняті наступні позначення:
      </ChapterParagraph>
      <TaskImage src={img9} width={"900px"}/>
      <ChapterParagraph>
        ЕП - елемент порівняння, що слугує для виявлення різниці між заданим і
        поточним значеннями регульованої величини і формує корисний сигнал (сигнал похибки, сигнал розугодження);
      </ChapterParagraph>
      <ChapterParagraph>
        ПЕ - перетворювальний елемент, що слугує для перетворення сигналу,
        що надходить із елемента порівняння, у такий сигнал, що дозволяє ПУ (регулятору) надати системі бажані динамічні властивості;
      </ChapterParagraph>
      <ChapterParagraph>
        ПіЕ - підсилювальний елемент; слугує для підсилення сигналу,
        що надходить до значення, достатнього для приведення в дію виконавчого елемента (механізму);
      </ChapterParagraph>
      <ChapterParagraph>
        ВЕ - виконавчий елемент; слугує для переміщення регулювального
        органу ОУ в напрямку компенсації сигналу розугодження, перетвореного ПУ (регулятором);
      </ChapterParagraph>
      <ChapterParagraph>
        РО - робочий (регулюючий ) орган;
      </ChapterParagraph>
      <ChapterParagraph>
        ОУ - об'єкт управління - технічний пристрій, що перетворює один вид енергії в іншій і здійснює корисну роботу;
      </ChapterParagraph>
      <ChapterParagraph>
        ЧЕ - чутливий елемент, що слугує для виміру основного збурення;
      </ChapterParagraph>
      <ChapterParagraph>
        МЗЗ - елемент місцевого зворотного зв'язку; слугує для додавання системі необхідних динамічних властивостей.
      </ChapterParagraph>
      <ChapterParagraph>
        Типовими елементами САУ, що відносяться до інформаційної та енергетичної
        частин, є: вимірювачі різних фізичних величин, що називаються чутливими
        елементами або датчиками; функціональні перетворювачі або обчислювальні
        пристрої (блоки зберігання і перетворення інформації), що здійснюють
        визначення параметрів управління, задане їхнє перетворення і виробляють
        сигнали управління; виконавчі елементи (пристрої), що безпосередньо здійснюють управління.
      </ChapterParagraph>
      <ChapterParagraph>
        Математичний опис або математичне моделювання САУ призначене для
        розв’язання задач аналізу та синтезу і зводиться до складання рівнянь,
        таблиць, графіків і т.п., що зв'язують вхідні і вихідні змінні в статичних і динамічних режимах.
      </ChapterParagraph>
      <ChapterParagraph>
        Для того, щоб вивчити властивості складної фізичної системи і навчитися
        управляти нею, необхідно одержати її математичну модель.
        Для цього потрібно встановити всі взаємозв'язки між змінними,
        що характеризують поведінку системи. Оскільки всі реальні системи
        за своєю природою є динамічними, то для їхнього опису природно
        використовувати диференціальні рівняння.
      </ChapterParagraph>
      <ChapterParagraph>
        Приступаючи до складання рівнянь, у системі спочатку вивчають фізичні
        процеси, що протікають у різних її ділянках, з'ясовуючи призначення
        окремих пристроїв та їхню взаємодію. Результатом такого розгляду є
        складання функціональної схеми системи.
      </ChapterParagraph>
      <ChapterParagraph>
        Виходячи зі зручності математичного опису, функціональні елементи
        розбивають на більш прості елементи - ланки, які мають спрямованість дії.
        Ланка спрямованої дії передає сигнал тільки в одному напрямку:
        від входу до виходу. Це дозволяє складати рівняння ланки без урахування її зв'язків з іншими ланками.
      </ChapterParagraph>
      <ChapterParagraph>
        На підставі рівнянь всіх ланок і рівнянь зв'язків між ними може
        бути отримане рівняння всієї системи.
        Представляючи всі функціональні елементи сукупністю ланок
        спрямованої дії, від функціональної схеми переходять до структурної схеми системи.
      </ChapterParagraph>
      <ChapterParagraph>
        Ланки зображуються прямокутниками, у які вписана так звана передавальна
        функція. Крім ланок у структурну схему входять вузли додавання і розгалуження.
        Всі елементи схеми з'єднуються лініями зі стрілками.
      </ChapterParagraph>
      <ChapterParagraph>
        Структурна схема визначає основу математичного опису САУ.
        Приклад структурної схеми САУ показаний на рис. 3.2.
      </ChapterParagraph>
      <TaskImage src={img10} width={"900px"}></TaskImage>
    </CoursePageWrapper>
  );
};

export default Chapter2_1;
